stars = {
    '0': ["  ***  ", " *   * ", "*     *", "*     *", "*     *", " *   * ", "  ***  "],
    '1': ["   *   ", "  **   ", "   *   ", "   *   ", "   *   ", "   *   ", "  ***  "],
    '2': ["  ***  ", " *   * ", "     * ", "    *  ", "   *   ", "  *    ", " ******"],
    '3': ["  ***  ", " *   * ", "     * ", "  ***  ", "     * ", " *   * ", "  ***  "],
    '4': ["    *  ", "   **  ", "  * *  ", " *  *  ", "*******", "    *  ", "    *  "],
    '5': [" ***** ", " *     ", " *     ", " ****  ", "     * ", " *   * ", "  ***  "],
    '6': ["  ***  ", " *     ", " *     ", " ****  ", " *   * ", " *   * ", "  ***  "],
    '7': [" ***** ", "     * ", "    *  ", "   *   ", "  *    ", " *     ", " *     "],
    '8': ["  ***  ", " *   * ", " *   * ", "  ***  ", " *   * ", " *   * ", "  ***  "],
    '9': ["  ***  ", " *   * ", " *   * ", "  **** ", "     * ", " *   * ", "  ***  "]
}


def print_date_in_stars(day, month, year):
    date_str = f"{day:02d} {month:02d} {year:04d}"
    lines = ["", "", "", "", "", "", ""]
    
    for char in date_str:
        if char in stars:
            for i, line in enumerate(stars[char]):
                lines[i] += line + "  "
        elif char == ' ':
            for i in range(7):
                lines[i] += "      "
    
    for line in lines:
        print(line)


day = int(input('Введите день рождения:\n'))
month = int(input('Введите месяц рождения:\n'))
year = int(input('Введите год рождения:\n'))


print_date_in_stars(day, month, year)